[
  {
    "id": 1,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/CwR670r/book1.png",
    "review": "To Kill a Mockingbird is a timeless classic that delves into the complexities of racial injustice and moral growth. Set in the fictional town of Maycomb, Alabama during the 1930s, the story follows young Scout Finch as she navigates the challenges of growing up amidst racial tensions. Through the trial of Tom Robinson, a black man falsely accused of assaulting a white woman, author Harper Lee explores themes of prejudice, empathy, and the loss of innocence. With its compelling characters and thought-provoking narrative, To Kill a Mockingbird continues to resonate with readers of all ages, serving as a poignant reminder of the importance of compassion and justice.",
    "totalPages": 281,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Classic", "Racial Injustice"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "id": 2,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/3B2ssd9/book2.png",
    "review": "The Great Gatsby by F. Scott Fitzgerald is a mesmerizing tale of love, ambition, and the American Dream. Set against the backdrop of the roaring twenties, the novel follows the enigmatic Jay Gatsby as he pursues his elusive love, Daisy Buchanan, amidst the opulence and excess of Long Island's elite. Through the eyes of narrator Nick Carraway, readers are transported into a world of glitz and glamour, where appearances often mask deeper truths. Fitzgerald's lyrical prose and vivid imagery paint a haunting portrait of a society grappling with the consequences of its own desires. A timeless masterpiece, The Great Gatsby remains a compelling exploration of the human condition and the pursuit of happiness.",
    "totalPages": 218,
    "rating": 4.2,
    "category": "Fiction",
    "tags": ["Classic", "Romance"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "id": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/Z1gtdqz/book3.png",
    "review": "1984, written by George Orwell, is a chilling dystopian novel that serves as a stark warning against totalitarianism and government oppression. Set in a future world where individuality is suppressed and Big Brother reigns supreme, the story follows Winston Smith, a disillusioned citizen who dares to defy the Party's control. As Winston navigates the oppressive regime and falls in love with fellow rebel Julia, he grapples with the consequences of his actions and the ever-present threat of surveillance. Orwell's thought-provoking narrative explores themes of power, manipulation, and the erosion of truth, offering a harrowing glimpse into a future where freedom is merely an illusion. A timeless classic, 1984 continues to resonate with readers as a cautionary tale about the dangers of authoritarianism and the importance of preserving personal liberty.",
    "totalPages": 328,
    "rating": 4.6,
    "category": "Science Fiction",
    "tags": ["Dystopian", "Political"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "id": 4,
    "bookName": "The Catcher in the Rye",
    "author": "J. D. Salinger",
    "image": "https://i.ibb.co/wcXRsrZ/book4.png",
    "review": "The Catcher in the Rye, penned by J. D. Salinger, is a poignant coming-of-age novel that captures the essence of teenage angst and disillusionment. Narrated by the troubled teenager Holden Caulfield, the story follows his journey through New York City as he grapples with the phoniness of the adult world and struggles to find meaning in his own life. Through Holden's cynical observations and introspective musings, Salinger paints a raw and honest portrait of adolescence, exploring themes of identity, alienation, and the search for authenticity. A literary classic beloved by generations of readers, The Catcher in the Rye remains a timeless portrayal of the universal struggles of youth and the quest for belonging.",
    "totalPages": 277,
    "rating": 4.0,
    "category": "Fiction",
    "tags": ["Coming-of-Age", "Teenage Angst"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "id": 5,
    "bookName": "Harry Potter and the Sorcerer's Stone",
    "author": "J. K. Rowling",
    "image": "https://i.ibb.co/Hp1xv3z/book5.png",
    "review": "Harry Potter and the Sorcerer's Stone by J. K. Rowling is a captivating fantasy adventure that introduces readers to the enchanting world of Hogwarts School of Witchcraft and Wizardry. Follow the journey of young Harry Potter as he discovers his magical heritage and embarks on a thrilling quest to uncover the truth about his past. With the help of his loyal friends Ron and Hermione, Harry faces formidable challenges and battles dark forces in a quest to thwart the dark wizard Voldemort. Rowling's imaginative storytelling, richly drawn characters, and intricate world-building create an immersive reading experience that captivates audiences of all ages. Filled with magic, friendship, and the power of love, Harry Potter and the Sorcerer's Stone is an enduring classic that continues to inspire readers around the globe.",
    "totalPages": 309,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Magic", "Adventure"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  },
  {
    "id": 6,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/1vTWJ2Y/book6.png",
    "review": "Pride and Prejudice, written by Jane Austen, is a timeless classic that continues to enchant readers with its witty social commentary and timeless romance. Set in early 19th-century England, the novel follows the headstrong Elizabeth Bennet as she navigates the intricacies of society and grapples with her own prejudices. When she meets the aloof and enigmatic Mr. Darcy, their initial animosity blossoms into a captivating love story filled with misunderstandings, wit, and undeniable chemistry. Austen's sparkling prose and keen observations of human nature illuminate themes of love, marriage, and the importance of self-awareness. With its memorable characters and enduring charm, Pride and Prejudice remains a beloved masterpiece that transcends time, offering readers a window into the complexities of the human heart.",
    "totalPages": 279,
    "rating": 4.7,
    "category": "Classic",
    "tags": ["Romance", "Social Commentary"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  }
]
